#%%
import csv
import json


# 地域の指定
area = 8


#%%
DictData = {
    "事務所等":{     
        "事務室":{},
        "電子計算機器事務室":{},
        "会議室":{},
        "喫茶室":{},
        "社員食堂":{},
        "中央監視室":{},
        "更衣室又は倉庫":{},
        "廊下":{},
        "ロビー":{},
        "便所":{},
        "喫煙室":{}
    },
    "ホテル等":{
        "客室":{},
        "客室内の浴室等":{},
        "終日利用されるフロント":{},
        "終日利用される事務室":{},
        "終日利用される廊下":{},
        "終日利用されるロビー":{},
        "終日利用される共用部の便所":{},
        "終日利用される喫煙室":{},
        "宴会場":{},
        "会議室":{},
        "結婚式場":{},
        "レストラン":{},
        "ラウンジ":{},
        "バー":{},
        "店舗":{},
        "社員食堂":{},
        "更衣室又は倉庫":{},
        "日中のみ利用されるフロント":{},
        "日中のみ利用される事務室":{},
        "日中のみ利用される廊下":{},
        "日中のみ利用されるロビー":{},
        "日中のみ利用される共用部の便所":{},
        "日中のみ利用される喫煙室":{}
    },
    "病院等":{
        "病室":{},
        "浴室等":{},
        "看護職員室":{},
        "終日利用される廊下":{},
        "終日利用されるロビー":{},
        "終日利用される共用部の便所":{},
        "終日利用される喫煙室":{},
        "診察室":{},
        "待合室":{},
        "手術室":{},
        "検査室":{},
        "集中治療室":{},
        "解剖室等":{},
        "レストラン":{},
        "事務室":{},
        "更衣室又は倉庫":{},
        "日中のみ利用される廊下":{},
        "日中のみ利用されるロビー":{},
        "日中のみ利用される共用部の便所":{},
        "日中のみ利用される喫煙室":{}
    },
    "物販店舗等":{
        "大型店の売場":{},
        "専門店の売場":{},
        "スーパーマーケットの売場":{},
        "荷さばき場":{},
        "事務室":{},
        "更衣室又は倉庫":{},
        "ロビー":{},
        "便所":{},
        "喫煙室":{}
    },
    "学校等":{
        "小中学校の教室":{},
        "高等学校の教室":{},
        "職員室":{},
        "小中学校又は高等学校の食堂":{},
        "大学の教室":{},
        "大学の食堂":{},
        "事務室":{},
        "研究室":{},
        "電子計算機器演習室":{},
        "実験室":{},
        "実習室":{},
        "講堂又は体育館":{},
        "宿直室":{},
        "更衣室又は倉庫":{},
        "廊下":{},
        "ロビー":{},
        "便所":{},
        "喫煙室":{}
    },
    "飲食店等":{
        "レストランの客室":{},
        "軽食店の客室":{},
        "喫茶店の客室":{},
        "バー":{},
        "フロント":{},
        "事務室":{},
        "更衣室又は倉庫":{},
        "廊下":{},
        "ロビー":{},
        "便所":{},
        "喫煙室":{}
    },
    "集会所等":{
        "アスレチック場の運動室":{},
        "アスレチック場のロビー":{},
        "アスレチック場の便所":{},
        "アスレチック場の喫煙室":{},
        "公式競技用スケート場":{},
        "公式競技用体育館":{},
        "一般競技用スケート場":{},
        "一般競技用体育館":{},
        "レクリエーション用スケート場":{},
        "レクリエーション用体育館":{},
        "競技場の客席":{},
        "競技場のロビー":{},
        "競技場の便所":{},
        "競技場の喫煙室":{},
        "浴場施設の浴室":{},
        "浴場施設の脱衣所":{},
        "浴場施設の休憩室":{},
        "浴場施設のロビー":{},
        "浴場施設の便所":{},
        "浴場施設の喫煙室":{},
        "映画館の客席":{},
        "映画館のロビー":{},
        "映画館の便所":{},
        "映画館の喫煙室":{},
        "図書館の図書室":{},
        "図書館のロビー":{},
        "図書館の便所":{},
        "図書館の喫煙室":{},
        "博物館の展示室":{},
        "博物館のロビー":{},
        "博物館の便所":{},
        "博物館の喫煙室":{},
        "劇場の楽屋":{},
        "劇場の舞台":{},
        "劇場の客席":{},
        "劇場のロビー":{},
        "劇場の便所":{},
        "劇場の喫煙室":{},
        "カラオケボックス":{},
        "ボーリング場":{},
        "ぱちんこ屋":{},
        "競馬場又は競輪場の客席":{},
        "競馬場又は競輪場の券売場":{},
        "競馬場又は競輪場の店舗":{},
        "競馬場又は競輪場のロビー":{},
        "競馬場又は競輪場の便所":{},
        "競馬場又は競輪場の喫煙室":{},
        "社寺の本殿":{},
        "社寺のロビー":{},
        "社寺の便所":{},
        "社寺の喫煙室":{}
    },
    "共同住宅":{
        "屋内廊下":{},
        "ロビー":{},
        "管理人室":{},
        "集会室":{}
    }
}

def convert_CSV2DICT(d):

    addData = {
        "冷房期":{
            "外気温変動":{
                "冷房負荷":{
                    "係数":float(d[0][3*(area-1)+6]),
                    "切片":float(d[0][3*(area-1)+7]),
                    "補正切片":float(d[0][3*(area-1)+8])
                },
                "暖房負荷":{
                    "係数":float(d[1][3*(area-1)+6]),
                    "切片":float(d[1][3*(area-1)+7]),
                    "補正切片":float(d[1][3*(area-1)+8])
                }
            },
            "日射量変動":{
                "冷房負荷":{
                    "係数":float(d[2][3*(area-1)+6]),
                    "切片":float(d[2][3*(area-1)+7]),
                    "補正切片":float(d[2][3*(area-1)+8])
                }
            }
        },
        "暖房期":{
            "外気温変動":{
                "冷房負荷":{
                    "係数":float(d[3][3*(area-1)+6]),
                    "切片":float(d[3][3*(area-1)+7]),
                    "補正切片":float(d[3][3*(area-1)+8])
                },
                "暖房負荷":{
                    "係数":float(d[4][3*(area-1)+6]),
                    "切片":float(d[4][3*(area-1)+7]),
                    "補正切片":float(d[4][3*(area-1)+8])
                }
            },
            "日射量変動":{
                "冷房負荷":{
                    "係数":float(d[5][3*(area-1)+6]),
                    "切片":float(d[5][3*(area-1)+7]),
                    "補正切片":float(d[5][3*(area-1)+8])
                }
            }
        },
        "中間期":{
            "外気温変動":{
                "冷房負荷":{
                    "係数":float(d[6][3*(area-1)+6]),
                    "切片":float(d[6][3*(area-1)+7]),
                    "補正切片":float(d[6][3*(area-1)+8])
                },
                "暖房負荷":{
                    "係数":float(d[7][3*(area-1)+6]),
                    "切片":float(d[7][3*(area-1)+7]),
                    "補正切片":float(d[7][3*(area-1)+8])
                }
            },
            "日射量変動":{
                "冷房負荷":{
                    "係数":float(d[8][3*(area-1)+6]),
                    "切片":float(d[8][3*(area-1)+7]),
                    "補正切片":float(d[8][3*(area-1)+8])
                }
            }
        }
    }

    return addData

# %%

# CSVファイル読み込み
with open('q_room_COEFFI.csv',encoding='Shift_JIS') as f:
    reader = csv.reader(f)
    csvdata = [row for row in reader]

for i in range(int(len(csvdata)/9)):

    d = csvdata[9*i:9*(i+1)]

    # 建物用途が空であれば
    if len(d[0][0])==0:
        d[0][0] = csvdata[9*(i-1)][0]
        d[0][1] = csvdata[9*(i-1)][1]

    if d[0][0] == "物品販売業を営む店舗等":
        d[0][0] = "物販店舗等"

    # 空調区分が空であれば
    if len(d[0][2])==0:
        d[0][2] = "終日空調"

    # 処理を実行
    if d[0][0] == "事務所等":
        DictData["事務所等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)   
    elif d[0][0] == "ホテル等":
        DictData["ホテル等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "病院等":
        DictData["病院等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "物販店舗等":
        DictData["物販店舗等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "学校等":
        DictData["学校等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "飲食店等":
        DictData["飲食店等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "集会所等":
        DictData["集会所等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "工場等":
        DictData["工場等"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)
    elif d[0][0] == "共同住宅":
        DictData["共同住宅"][d[0][1]][d[0][2]] = convert_CSV2DICT(d)

#%%
# JSONに書き込み
fw = open('q_room_COEFFI_area'+ str(area) +'.json','w')
json.dump(DictData, fw, indent=4, ensure_ascii=False)


# %%
